Revit 2024 API
FabricationConfigurationInfo.UnitSystem Property
 The unit system of the fabrication configuration. Units can be UnitSystem.Metric or UnitSystem.Imperial.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public UnitSystem UnitSystem { get; }
Visual Basic
Public ReadOnly Property UnitSystem As UnitSystem
	Get
Visual C++
public:
property UnitSystem UnitSystem {
	UnitSystem get ();
}
See Also
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace